.emacs.d/Emacs.org
#+title: GNU Emacs Configuration
#+author: Kenneth Xu
#+language: en-gb
#+options: ':t toc:nil num:t author:t email:t
#+startup: content indent
#+property: header-args:emacs-lisp :mkdirp yes

This is my literate configuration for GNU Emacs. It uses ~org-babel~, a package which allows for the use of written text alongside blocks of code.
My configuration is heavily inspired by Protesilaos, an Emacs package maintainer and content creator. It is likely you will see some parallels between my configuration and his.
*You can check my [[https://github.com/kxu111/dotfiles][dotfiles]] to see what OS and build of Emacs I am using*.

Usually, people use their =init.el= to call the command ~org-babel-load-file~ in order to load their literate configuration. However, I believe this method is ineffective because using it forces us to load Org before starting Emacs. Instead, I will make use of this command:

#+begin_src emacs-lisp :tangle no :results none
(org-babel-tangle)
#+end_src

The command ~org-babel-tangle~ (bound to =C-c C-v C-t=), takes the blocks of code from inside your configuration and deploys them inside of standalone files. That way, you can write all of your configuration inside one literate configuration file, but you don't have to deal with the inefficiency that comes with being forced to start Emacs from an Org file.

~Org-babel~ allows you to have a modular configuration while also being able to manage everything from one place. This has many advantages. For example, you can continue treating a singular file as the "root" of your configuration, however if somebody wishes to see a know how you accomplished something, you need only send them the relevant files, as opposed to sending them your entire configuration.
Additionally, if you weren't convinced already, you also gain access a whole host of the advantages that come with working with Org files, for example the ability to export your configuration as a PDF or website.

* The anatomy of an Emacs configuration

The current Org file is not loaded on Emacs' startup. Rather, it generates the files that Emacs will read. Here is a list of the files that this Org file will generate:

- Standard file =early-init.el= :: Configures the Emacs frame and defines the behaviour of Emacs in its loading phase.

- Standard file =init.el= :: This sets up some Emacs Lisp macros, runs some fixes (e.g disabling the custom file) and loads the configuration modules.

- Custom folder =my-modules/= :: This contains some custom modules I defined. A module is nothing more than a group of related packages, modes, and settings.

- Custom folder =my-libraries/= :: This contains custom Emacs Lisp I write that I can use in other places of my configuration, but aren't as lightweight and commonly used as the macros in =init.lua=.

* The package manager (=straight.el=)

I use =straight.el= thanks to its ability to create lockfiles.
=straight.el='s Github: <https://github.com/radian-software/straight.el>

** The =early-init.el= disables package in favour of =straight.el=

#+begin_src emacs-lisp :tangle "early-init.el"
;; Disable package in favour of "straight.el".
(setq package-enable-at-startup nil)
#+end_src

** The =init.el= bootstraps =straight.el=

#+begin_src emacs-lisp :tangle "init.el"
;; Bootstrap "straight.el"
(defvar bootstrap-version)
(let ((bootstrap-file
       (expand-file-name
        "straight/repos/straight.el/bootstrap.el"
        (or (bound-and-true-p straight-base-dir)
            user-emacs-directory)))
      (bootstrap-version 7))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
        (url-retrieve-synchronously
         "https://raw.githubusercontent.com/radian-software/straight.el/develop/install.el"
         'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))

(straight-use-package 'use-package)

(use-package straight
  :custom
  (straight-use-package-by-default t)
  (straight-current-profile 'base)
  (straight-vc-git-default-protocol 'ssh)
  :config
  (setq straight-profiles `((base . "~/dotfiles/.emacs.d/lockfile.el"))))
#+end_src

* The early initialisation of Emacs (=early-init.el=)

** The =early-init.el= basic frame settings

Keep in mind ~frame-resize-pixelwise~ and ~frame-inhibit-implied-resize~ are important; without it, Emacs will use strange frame sizes and resize the frame if you adjust the font size.

#+begin_src emacs-lisp :tangle "early-init.el"
(setq frame-resize-pixelwise t
      frame-inhibit-implied-resize 'force
      frame-title-format '("%b")
      ring-bell-function 'ignore
      use-short-answers t
      inhibit-startup-screen t
      inhibit-startup-echo-area-message user-login-name ; Disable the message in the minibuffer on Emacs start.
      )

(menu-bar-mode -1)
(tool-bar-mode -1)
(scroll-bar-mode -1)
(tooltip-mode -1)
(blink-cursor-mode -1)
#+end_src

** The =early-init.el= set frame parameters and variables based on platform

Here I set options based on what platform I am using, such as rebinding keys, or modifying the aesthetics of the frame.

When I use MacOS, I am using [[https://github.com/d12frosted/homebrew-emacs-plus][Emacs Plus]].

Keep in mind that ~initial-frame-alist~ only affects the first frame while ~default-frame-alist~ affects all future frames.

#+begin_src emacs-lisp :tangle "early-init.el"
  (add-to-list 'initial-frame-alist '(fullscreen . maximized))

  ;; MacOS options
  (when (eq system-type 'darwin)
    (add-to-list 'default-frame-alist '(ns-transparent-titlebar . t))
    (setq mac-command-modifier 'meta
  	mac-right-command-modifier 'super
          mac-option-modifier nil))
#+end_src

** The =early-init.el= tweaks to startup time and garbage collection

This is code copied from Protesilaos' configuration. In this snippet, he raises some variables to high values until Emacs loads, at which point he lowers them to a more practical amount.

#+begin_src emacs-lisp :tangle "early-init.el"
;; Temporarily increase the garbage collection threshold.  These
;; changes help shave off about half a second of startup time.  The
;; `most-positive-fixnum' is DANGEROUS AS A PERMANENT VALUE.  See the
;; `emacs-startup-hook' a few lines below for what I actually use.
(setq gc-cons-threshold most-positive-fixnum
      gc-cons-percentage 0.5)

;; Same idea as above for the `file-name-handler-alist' and the
;; `vc-handled-backends' with regard to startup speed optimisation.
;; Here I am storing the default value with the intent of restoring it
;; via the `emacs-startup-hook'.
(defvar prot-emacs--file-name-handler-alist file-name-handler-alist)
(defvar prot-emacs--vc-handled-backends vc-handled-backends)

(setq file-name-handler-alist nil
      vc-handled-backends nil)

(add-hook 'emacs-startup-hook
          (lambda ()
            (setq gc-cons-threshold (* 100 100 8)
                  gc-cons-percentage 0.1
                  file-name-handler-alist prot-emacs--file-name-handler-alist
                  vc-handled-backends prot-emacs--vc-handled-backends)))
#+end_src

** The =early-init.el= makes loading frame match theme

Make the initial frame match your theme's background colors.

#+begin_src emacs-lisp :tangle ./early-init.el
(defun my-emacs-re-enable-theme (_frame)
  (when-let* ((theme (car custom-enabled-themes)))
    (enable-theme theme)))

;; Make the initial frame match your theme's background colors.
(defun my-emacs-fix-start-bg ()
  (setq mode-line-format nil)
  (set-face-attribute 'default nil :background "#000000" :foreground "#ffffff")
  (set-face-attribute 'mode-line nil :background "#000000" :foreground "#ffffff" :box 'unspecified)
  (add-hook 'after-make-frame-functions #'my-emacs-re-enable-theme))

(my-emacs-fix-start-bg)
#+end_src

** The =early-init.el= sets the ~user-lisp-directory~

The ~user-lisp-directory~ is a user option introduced in Emacs 31. It makes Emacs byte compile Emacs Lisp files therein and scan them for autoloads.

#+begin_src emacs-lisp :tangle "early-init.el"
(setq user-lisp-directory (locate-user-emacs-file "my-libraries/"))
#+end_src

* The main initialisation of Emacs (=init.el=)

** The =init.el= tweaks to make native compilation silent

Native compilation helps speed up Emacs by translating Emacs Lisp down to machine code. However, it has an annoying habit of displaying verbose errors which usually don't mean anything *to the average user*.

#+begin_src emacs-lisp :tangle "init.el"
;; Make native compilation silent.
(when (native-comp-available-p)
  (setq native-comp-async-report-warnings-errors 'silent))
#+end_src

** The =init.el= obliviates the custom file

The custom file is an absolutely useless feature of Emacs that contributes very little to my configuration, if at all. This is because I use =straight.el= to manage my installed packages (something the custom file usually does) and you can set =custom-safe-themes= to =t=, removing the need to track what themes are trusted. And finally, if you use =M-x customize=, you're probably a psychopath.

This code works by sending the custom file to the =/tmp= directory, which is automatically cleared when you close your computer. Additionally, the file is never loaded, effectively removing it from existence.

#+begin_src emacs-lisp :tangle "init.el"
;; Disable the custom file by sending it to the temporary directory.
(setq custom-file (make-temp-file "emacs-custom-"))
#+end_src

** The =init.el= option to declare all themes as safe

Marks all themes as safe. I trust the devs :)
As a precaution, don't try lesser-known packages before vetting the code.

#+begin_src emacs-lisp :tangle "init.el"
(setq custom-safe-themes t)
#+end_src

** The =init.el= macro to configure a package (~my-emacs-configure~)

The ~my-emacs-configure~ is a simple wrapper around ~condition-case~. The idea is to add arbitrary code for the configuration of a given package and catch any errors so that Emacs can still load without that package's code.

#+begin_src emacs-lisp :tangle "init.el"
(defmacro my-emacs-configure (&rest body)
  "Evaluate BODY and catch any errors."
  (declare (indent 0))
  `(condition-case err
       (progn ,@body)
     ((error user-error quit)
      (warn "Failed to configure package starting with `%S' because of `%S'" (car ',body) (cdr err)))))
#+end_src

** The =init.el= minor mode for keybind overrides (~my-bind-overrides-mode~)

#+begin_src emacs-lisp :tangle "init.el"
(defvar my-bind-overrides-mode-map (make-sparse-keymap)
  "Keymap for `my-bind-overrides-mode'.")

(define-minor-mode my-bind-overrides-mode
  "Activate `my-bind-overrides-mode-map'."
  :global t
  :init-value nil
  :keymap my-bind-overrides-mode-map)
#+end_src

** The =init.el= loads my modules and libraries

#+begin_src emacs-lisp :tangle "init.el"
(mapc
 (lambda (string)
   (add-to-list 'load-path (locate-user-emacs-file string)))
 '("my-libraries" "my-modules"))
#+end_src

** The =init.el= second-last part to source the modules

I'm going to use Protesilaos as a reference once again and split my configuration into multiple files.

Splitting into multiple files allows me to review the individual source code files rather than searching through a large Org file.

#+begin_src emacs-lisp :tangle "init.el"
(require 'my-mod-theme)
(require 'my-mod-essentials)
(require 'my-mod-modeline)
(require 'my-mod-git)
(require 'my-mod-org)
(require 'my-mod-prog)
(require 'my-mod-text-editing)
(require 'my-mod-split-windows)
(require 'my-mod-completions)
(require 'my-mod-elfeed)
#+end_src

** The =init.el= final part to load keybind overrides (~my-bind-overrides-mode~)

#+begin_src emacs-lisp :tangle "init.el"
(my-bind-overrides-mode t)
#+end_src

* The modules in my configuration (=my-modules/=)

** The =my-mod-theme.el= module

*** TODO Implement theme picker

- Make it so you can change fonts on theme switch
- Add custom overrides for each theme

*** The =my-mod-theme.el= section to load themes

*Some Favourite Themes*:
- doric-dark
- doom-dark+
- doric-light

#+begin_src emacs-lisp :tangle "my-modules/my-mod-theme.el"
(my-emacs-configure
 (use-package doric-themes)
 (load-theme 'doric-obsidian))
#+end_src

*** The =my-mod-theme.el= section to load fonts

*Favourite Fonts*:
- =Iosevka=
- =Aporetic Sans/Serif Mono=
- =IBM Plex Mono=

#+begin_src emacs-lisp :tangle "my-modules/my-mod-theme.el"
(my-emacs-configure
 (set-face-font 'default "Aporetic Sans Mono 20")
 (set-face-font 'fixed-pitch "Aporetic Sans Mono 20")
 (set-face-font 'variable-pitch "Aporetic Sans 20"))
#+end_src

*** The =my-mod-theme.el= call to ~provide~

#+begin_src emacs-lisp :tangle "my-modules/my-mod-theme.el"
(provide 'my-mod-theme)
#+end_src

** The =my-mod-essentials.el= module

To me, anything essential is anything that's vanilla Emacs that isn't terribly complicated.

*** The =my-mod-essentials.el= section for ~delete-selection-mode~

For some crazy reason, Emacs does not automatically delete your selection when you begin typing over it. This mode fixes that.

#+begin_src emacs-lisp :tangle "my-modules/my-mod-essentials.el"
(my-emacs-configure
 (delete-selection-mode t))
#+end_src

*** The =my-mod-essentials.el= section for ~global-auto-revert-mode~

By default, Emacs will not update your buffer even if the underlying file is updated. This mode changes that.

#+begin_src emacs-lisp :tangle "my-modules/my-mod-essentials.el"
(my-emacs-configure
  (global-auto-revert-mode 1)
  (setq auto-revert-verbose t))
#+end_src

