.emacs.d/Emacs.org
*** The =my-mod-essentials.el= section for ~which-key-mode~

Emacs 30 added ~which-key-mode~, which gives you a list of the next keys you can press when you forget a key chord. For example, if I press =C-x= it will suggest =C-x 1= for ~delete-other-windows~.

#+begin_src emacs-lisp :tangle "my-modules/my-mod-essentials.el"
(my-emacs-configure
 (setq which-key-separator "  "
       which-key-prefix-prefix "... "
       which-key-max-display-columns 3
       which-key-idle-delay 1.5
       which-key-idle-secondary-delay 0.25
       which-key-add-column-padding 1
       which-key-max-description-length 40)

 (which-key-mode 1))
#+end_src

*** The =my-mod-essentials.el= hook for ~delete-trailing-whitespace~

If you use ~auto-save-visited-mode~, you may find it annoying that your whitespaces keep getting involuntarily deleted. In such a case, I would recommend binding ~delete-trailing-whitespace~ to =C-x s= or whatever your save keybinding is.

#+begin_src emacs-lisp :tangle "my-modules/my-mod-essentials.el"
(add-hook 'before-save-hook #'delete-trailing-whitespace)
#+end_src

*** The =my-mod-essentials.el= bind to ~duplicate-line~

#+begin_src emacs-lisp :tangle "my-modules/my-mod-essentials.el"
(define-key my-bind-overrides-mode-map
            (kbd "C-,")
            (lambda ()
              (interactive)
              (duplicate-line)
              (next-line)))
#+end_src

*** The =my-mod-essentials.el= bind to ~grep-change-to-grep-edit-mode~

Writable ~grep-mode~ now comes built inside Emacs 31.

#+begin_src emacs-lisp :tangle "my-modules/my-mod-essentials.el"
(my-emacs-configure
 (with-eval-after-load 'grep
   (define-key grep-mode-map (kbd "e") #'grep-change-to-wgrep-mode)))
#+end_src

*** The =my-mod-essentials.el= call to ~provide~

#+begin_src emacs-lisp :tangle "my-modules/my-mod-essentials.el"
(provide 'my-mod-essentials)
#+end_src

** The =my-mod-modeline.el= module

#+begin_src emacs-lisp :tangle "my-modules/my-mod-modeline.el"
  (require 'my-lib-modeline)

  (setq display-time-string-forms '((format-time-string "%a %d %b, %H:%M")))
  (display-time-mode t)

  (setq-default mode-line-format
                (list
                 "  %e"
                 my-modeline-read-only
                 my-modeline-buffer-name
                 "  "
                 my-modeline-major-mode
                 'mode-line-process
                 "  "
                 my-modeline-vc
                 'mode-line-format-right-align
                 my-modeline-multiple-cursors
                 my-modeline-position
                 "  "
                 my-modeline-misc-info
                 "  "))
#+end_src

*** The =my-mod-modeline.el= call to ~provide~

#+begin_src emacs-lisp :tangle "my-modules/my-mod-modeline.el"
(provide 'my-mod-modeline)
#+end_src

** The =my-mod-git.el= module

*** The =my-mod-git.el= section for =vc.el=

VC refers to "version control", which is what allows you to track your files and visualise changes across different versions of your data.

#+begin_src emacs-lisp :tangle "my-modules/my-mod-git.el"
(my-emacs-configure
 (setq vc-follow-symlinks t)

 (with-eval-after-load 'vc
    ;; I only use Git.  If I ever need another, I will include it here.
    ;; This may have an effect on performance, as Emacs will not try to
    ;; check for a bunch of backends.
    (setq vc-handled-backends '(Git))

    (setq vc-dir-save-some-buffers-on-revert t)))
#+end_src

*** The =prot-emacs-git.el= section for ~magit~

Magit is an amazing package. It can basically do everything the builtin =vc.el= can do, and that's with no setup.
Start by pressing =C-x g= (~magit-status~) to bring up the state of the repository.

#+begin_src emacs-lisp :tangle "my-modules/my-mod-git.el"
(my-emacs-configure
 (use-package magit))
#+end_src

*** The =my-emacs-git.el= call to ~provide~

#+begin_src emacs-lisp :tangle "my-modules/my-mod-git.el"
(provide 'my-mod-git)
#+end_src

** The =my-mod-org.el= module

*** The =my-mod-org.el= section to setup ~org-mode~

I like to pull ~org-mode~ straight from the git mirror as to get the cutting-edge version.

#+begin_src emacs-lisp :tangle "my-modules/my-mod-org.el"
(my-emacs-configure
 (use-package org
   :straight (:host github :repo "bzg/org-mode" :branch "main")
   :hook (org-mode . visual-line-mode)
   :custom
   (org-use-speed-commands t) ; M-x org-speed-commands-help
   (org-startup-indented t)
   (org-hide-emphasis-markers t)
   (org-cycle-separator-lines 1) ; Keep a line between folded headings
   (org-src-content-indentation 0)
   ))
#+end_src

*** The =my-mod-org.el= section for ~org-babel~

~Org-babel~ is what allows for literate configurations like this one.

~Org-tempo~ is very useful for Babel. It allows you to type something like =<el <TAB>= and it will expand into an Emacs Lisp codeblock.

#+begin_src emacs-lisp :tangle "my-modules/my-mod-org.el"
(my-emacs-configure
  (org-babel-do-load-languages
  'org-babel-load-languages
  '((emacs-lisp . t)
    (shell . t)
    ))

 (require 'org-tempo)
 (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
 (add-to-list 'org-structure-template-alist '("sh" . "src shell")))
#+end_src

*** The =my-mod-org.el= section to fix "lexical binding" warning

*** The =my-mod-org.el= section for ~org-roam~

#+begin_src emacs-lisp :tangle "my-modules/my-mod-org.el"
(my-emacs-configure
 (use-package org-roam
   :bind
   ("C-c n c" . org-roam-capture)
   ("C-c n f" . org-roam-node-find)
   ("C-c n i" . org-roam-node-insert)
   :custom (org-capture-bookmark nil)
   :config (org-roam-db-autosync-mode t))

 ;; ":commands" implies defer until the command is run
 (use-package org-roam-ui :commands org-roam-ui-mode))
#+end_src

*** The =my-mod-org.el= call to ~provide~

#+begin_src emacs-lisp :tangle "my-modules/my-mod-org.el"
(provide 'my-mod-org)
#+end_src

** The =my-mod-prog.el= module

This module is to configure packages and parameters relevant to ~prog-mode~.

*When installing programming modes, use ~:defer t~ to avoid them loading preemptively.* I don't know if this does anything, but it's good to be safe.

*** The =my-mod-prog.el= section for ~eglot~ (LSP client)

~Eglot~ is a client for using LSP (Language Server Protocol) servers. I prefer it over ~lsp-mode~ because it is more lightweight and makes use of builtin Emacs features rather than implementing its own.

#+begin_src emacs-lisp :tangle "my-modules/my-mod-prog.el"
(my-emacs-configure
 (use-package eglot
   :bind
   (:map eglot-mode-map
         ("C-c l a" . eglot-code-actions)
         ("C-c l r" . eglot-rename)
         ("C-c l f" . eglot-format))))
#+end_src

To enable an ~eglot~ for a specific mode, add the following to your configuration. Of course, you must have a supported language server installed first, but that's out of scope for this.

#+begin_example emacs-lisp
(add-hook 'SAMPLE-MAJOR-mode . #'eglot-ensure)
#+end_example

*** The =my-mod-prog.el= section for ~c++-mode~

#+begin_src emacs-lisp :tangle "my-modules/my-mod-prog.el"
;; c++ mode is built in
(add-hook 'c++-mode #'eglot-ensure)
#+end_src

*** The =my-mod-prog.el= section for ~nix-mode~

#+begin_src emacs-lisp :tangle "my-modules/my-mod-prog.el"
(my-emacs-configure
 (use-package nix-mode :defer t)
 (add-hook nix-mode-hook . eglot-ensure))
#+end_src

*** The =my-mod-prog.el= call to ~provide~

#+begin_src emacs-lisp :tangle "my-modules/my-mod-prog.el"
(provide 'my-mod-prog)
#+end_src

** The =my-mod-text-editing= module

The idea for these keymaps is to keep your fingers on the =CTRL=, =META=, and =hjkl= keys for the majority of the time. The =,= and the =.= are also significant.

#+begin_src emacs-lisp :tangle "my-modules/my-mod-text-editing.el"
(my-emacs-configure
 (use-package multiple-cursors
   :custom
   (mc/always-run-for-all t)
   :config
   (define-key my-bind-overrides-mode-map (kbd "C-M-j") #'mc/mark-all-dwim)
   (define-key my-bind-overrides-mode-map (kbd "C-M-/") #'mc/mark-all-like-this)

   (define-key my-bind-overrides-mode-map (kbd "C-M-,") #'mc/mark-previous-like-this)
   (define-key my-bind-overrides-mode-map (kbd "C-M-.") #'mc/mark-next-like-this)

   (define-key my-bind-overrides-mode-map (kbd "C-<") #'mc/skip-to-previous-like-this)
   (define-key my-bind-overrides-mode-map (kbd "C->") #'mc/skip-to-next-like-this)

   (define-key my-bind-overrides-mode-map (kbd "C-M-c") #'mc/edit-lines)
   (define-key my-bind-overrides-mode-map (kbd "C-M-n") #'mc/insert-numbers)
   (define-key my-bind-overrides-mode-map (kbd "C-M-'") #'mc-hide-unmatched-lines-mode))

 (use-package expreg
   :config
   (define-key my-bind-overrides-mode-map (kbd "C-M-l") #'expreg-expand)
   (define-key my-bind-overrides-mode-map (kbd "C-M-h") #'expreg-contract))

 (use-package move-text
   :config
   (define-key my-bind-overrides-mode-map (kbd "M-p") #'move-text-up)
   (define-key my-bind-overrides-mode-map (kbd "M-n") #'move-text-down)))
#+end_src

*** The =my-mod-text-editing= call to ~provide~

#+begin_src emacs-lisp :tangle "my-modules/my-mod-text-editing.el"
(provide 'my-mod-text-editing)
#+end_src

** The =my-mod-split-windows= module

#+begin_src emacs-lisp :tangle "my-modules/my-mod-split-windows.el"
(my-emacs-configure
 (use-package golden-ratio
   :config
   (golden-ratio-mode t)
   (add-to-list 'golden-ratio-extra-commands 'ace-window))

 (use-package ace-window :config (define-key my-bind-overrides-mode-map (kbd "M-o") #'ace-window)))
#+end_src

*** The =my-mod-split-windows= call to ~provide~

#+begin_src emacs-lisp :tangle "my-modules/my-mod-split-windows.el"
(provide 'my-mod-split-windows)
#+end_src

** The =my-mod-completions= module

*** The =my-mod-completions= sets variables for minibuffer

#+begin_src emacs-lisp :tangle "my-modules/my-mod-completions.el"
(savehist-mode t)
#+end_src

*** The =my-mod-completions= submodule for vertico

#+begin_src emacs-lisp :tangle "my-modules/my-mod-completions.el"
(my-emacs-configure
 (use-package vertico
   :config
   (vertico-mode)
   (vertico-multiform-mode)
   :custom
   (vertico-multiform-commands ; Customize display per-command
    '((execute-extended-command flat)))
   (vertico-resize t)
   (vertico-count 12)))
#+end_src

*** The =my-mod-completions= submodule for consult

I enjoy using =M-s= combined with another keybind in order to create lots of keybinds without using too many slots on the keyboard, and as a bonus it helps all the keybinds feel cohesive.

#+begin_src emacs-lisp :tangle "my-modules/my-mod-completions.el"
(my-emacs-configure
 (use-package consult
   :bind
   ("M-s M-g" . consult-ripgrep)
   ("M-s M-f" . find-file)
   ("M-s M-d" . consult-fd) ; Mnemonic: Search Directory
   ("M-s M-o" . consult-outline)
   ("M-s M-l" . consult-line)
   ("M-s M-b" . consult-buffer)
   ("M-s M-k" . kill-buffer)

   :config
   (setq consult-ripgrep-args "rg --null --line-buffered --color=never --max-columns=1000 --path-separator / --smart-case --no-heading --with-filename --line-number --search-zip --hidden"
         consult-fd-args "fd --full-path --color=never --hidden")

   ;; Don't display these buffers
   (let ((buffers '("*Async-native-compile-log*" "*straight-process*" "*straight-byte-compilation*" "*direnv*" "*Messages*" "*Help*" "*Backtrace*" "*Warnings*" "*Native-compile-Log" "*elfeed-tube-log*")))
     (dolist (buf buffers) (add-to-list 'consult-buffer-filter (regexp-quote buf))))
   (add-to-list 'consult-buffer-filter "\\*EGLOT.*\\*")
   (add-to-list 'consult-buffer-filter "magit.*:")))
#+end_src

*** The =my-mod-completions= submodule for miscellaneous minibuffer packages

#+begin_src emacs-lisp :tangle "my-modules/my-mod-completions.el"
(my-emacs-configure
 (use-package marginalia :config (marginalia-mode))

 (use-package orderless :config (setq completion-styles '(orderless basic)))

 (use-package embark
   :bind
   ("C-." . embark-act)
   (:map minibuffer-local-map
         ("C-c C-c" . embark-collect)
         ("C-c C-e" . embark-export)))

 (use-package embark-consult))
#+end_src

*** The =my-mod-completions= submodule for in-buffer completions

#+begin_src emacs-lisp :tangle "my-modules/my-mod-completions.el"
(my-emacs-configure
 (use-package corfu
   :custom
   (corfu-count 6)
   (corfu-auto-prefix 2)
   :init
   (global-corfu-mode)
   (corfu-popupinfo-mode)
   :hook (prog-mode . (lambda () (setq-local corfu-auto t)))
   :bind (:map corfu-map ("M-SPC" . corfu-insert-separator))))
#+end_src

*** The =my-mod-completions= call to ~provide~

#+begin_src emacs-lisp :tangle "my-modules/my-mod-completions.el"
(provide 'my-mod-completions)
#+end_src

** The =my-mod-elfeed= module

*** The =my-mod-elfeed= base setup

#+begin_src emacs-lisp :tangle "my-modules/my-mod-elfeed.el"
(my-emacs-configure
 (use-package elfeed
   :bind ("C-x f" . elfeed)
   :hook (elfeed-show-mode . visual-line-mode)
   :custom (elfeed-search-filter "@6months +unread -junk"))

 (use-package elfeed-org
   :after elfeed
   :config (elfeed-org)))
#+end_src

*** The =my-mod-elfeed= ~elfeed-tube~ setup

#+begin_src emacs-lisp :tangle "my-modules/my-mod-elfeed.el"
(my-emacs-configure
 (use-package elfeed-tube
   :after elfeed
   :bind
   (:map elfeed-show-mode-map
         ("F" . elfeed-tube-fetch)
         ([remap save-buffer] . elfeed-tube-save))
   (:map elfeed-search-mode-map
         ("F" . elfeed-tube-fetch)
         ([remap save-buffer] . elfeed-tube-save))
   :config
   (elfeed-tube-setup)
   (add-hook 'elfeed-new-entry-hook
             (elfeed-make-tagger :entry-link "https://www\\.youtube\\.com/shorts/.*"
                                 :add 'junk
                                 :remove 'unread)))

 (use-package mpv)
 (use-package elfeed-tube-mpv
   :after elfeed
   :bind
   (:map elfeed-show-mode-map
         ("<return>" . elfeed-tube-mpv)
         ("C-c C-f" . elfeed-tube-mpv-follow-mode)
         ("C-c C-w" . elfeed-tube-mpv-where))))
#+end_src

