.emacs.d/my-modules/my-mod-elfeed.el

(provide 'my-mod-elfeed)
